/* No comment provided by engineer. */
"%@ (Disabled: %@)" = "%1$@ (Desativado: %2$@)";

/* No comment provided by engineer. */
"%@ can't be empty" = "%@ não pode estar em branco";

/* No comment provided by engineer. */
"(Tap to edit, hold to re-order)" = "(Toque para editar, pressione para reordenar)";

/* No comment provided by engineer. */
"(Use Default)" = "(Predefinição de Utilização)";

/* SettingsViewController */
"About" = "Sobre";

/* No comment provided by engineer. */
"Add Bookmark" = "Adicionar Marcador";

/* No comment provided by engineer. */
"All rules" = "Todas as regras";

/* SettingsViewController */
"Allow 3rd-Party Keyboards" = "Permitir teclados de terceiros";

/* SecurityViewController */
"Allow hosts to access WebRTC functions." = "Permitir que os hospedeiros acedam às funções de WebRTC.";

/* SecurityViewController */
"Allow hosts to permanently store cookies and local storage databases." = "Permitir que os hospedeiros armazenem permanentemente os cookies e as bases de dados de armazenamento local.";

/* SecurityViewController */
"Allow HTTPS hosts to load page resources from non-HTTPS hosts. (Useful for RSS readers and other aggregators.)" = "Permitir que os hospedeiros HTTPS carreguem os recursos de página dos hospedeiros não HTTPS (útil para leitores de RSS e outros agregadores)";

/* SecurityViewController */
"Allow Persistent Cookies" = "Permitir cookies persistentes";

/* No comment provided by engineer. */
"Allow this page to close its tab?" = "Permitir que esta página feche o próprio separador?";

/* No comment provided by engineer. */
"An error occurred downloading image %@" = "Ocorreu um erro ao transferir a imagem %@";

/* Donate Scene. */
"Are you sure you want to send a %@ tip?" = "Are you sure you want to send a %@ tip?";

/* No comment provided by engineer. */
"Authentication Required" = "Autenticação Obrigatória";

/* No comment provided by engineer. */
"Block external LAN requests" = "Bloquear pedidos de REDE externos";

/* No comment provided by engineer. */
"Blocked 3rd-Party Hosts" = "Hospedeiros de Terceiros Bloqueados";

/* No comment provided by engineer. */
"Bookmarks" = "Marcadores";

/* Cancel
   Cancel action */
"Cancel" = "Cancelar";

/* SettingsViewController */
"Changing this option requires restarting the app." = "Ao alterar esta opção requer o reinício da aplicação.";

/* No comment provided by engineer. */
"Close Tab" = "Fechar Separador";

/* No comment provided by engineer. */
"Confirm" = "Confirmar";

/* Donate Scene. */
"Confirm %@" = "Confirm %@";

/* Donate Scene. */
"Confirm Purchase" = "Confirm Purchase";

/* SecurityViewController */
"Content Policy" = "Política de Conteúdo";

/* Storage1ViewController */
"Cookies and local storage data from non-whitelisted hosts will be cleared even from open tabs after not being accessed for this many minutes." = "Os cookies e os dados de armazenamento local dos hospedeiros não listados nas permissões serão limpos, mesmo os dos separadores abertos, depois de não serem acedidos ​​por estes muitos minutos.";

/* No comment provided by engineer. */
"Copy URL" = "Copiar URL";

/* No comment provided by engineer. */
"Create New Tab" = "Criar Novo Separador";

/* No comment provided by engineer. */
"Custom settings" = "Definições personalizadas";

/* SecurityViewController */
"Custom user-agent string, or blank to use the default." = "Cadeia de agente do utilizador personalizada ou em branco para usar a predefinição.";

/* No comment provided by engineer. */
"Default Settings" = "Definições Personalizadas";

/* No comment provided by engineer. */
"Disable" = "Desativar";

/* No comment provided by engineer. */
"Disabled: %@" = "Desativado: %@";

/* Donate Scene. */
"Donate" = "Doar";

/* No comment provided by engineer. */
"Done" = "Concluído";

/* No comment provided by engineer. */
"Double-tap to dismiss pop-up window." = "Toque duplo para rejeitar a janela.";

/* No comment provided by engineer. */
"Edit Bookmark" = "Editar Marcador";

/* No comment provided by engineer. */
"Enable" = "Ativar";

/* No comment provided by engineer. */
"Enter the details of the URL to bookmark:" = "Insira os detalhes do URL para colocar nos marcadores:";

/* No comment provided by engineer. */
"Enter the host/domain to define settings for" = "Insira o hospedeiro/domínio para definir as definições para";

/* No comment provided by engineer. */
"Error" = "Erro";

/* No comment provided by engineer. */
"Fill with 1Password" = "Preencher com 1Password";

/* No comment provided by engineer. */
"Focus URL Field" = "Campo de URL de Focus";

/* Donate Scene. */
"Fund Development" = "Fund Development";

/* No comment provided by engineer. */
"Bridge Configuration" = "Configuração da Ponte";

/* No comment provided by engineer. */
"Tor connection failure" = "A ligação do Tor falhou";

/* No comment provided by engineer. */
"__CONNECTION_FAILURE_DESCRIPTION__" = "O Onion Browser perdeu a ligação com a rede de anonimato do Tor e não consegue religar. Isto pode ocorrer se o Onion Browser foi para segundo plano ou se o dispositivo foi suspenso enquanto o Onion Browser estava ativo.\n\nPor favor, saia da aplicação e tente novamente. Se precisar de colocar nos marcadores a página atual ou guardar a informação da mesma, pressione 'OK' para permanecer na aplicação sem o recurso de rede.";

/* No comment provided by engineer. */
"Quit App" = "Fechar Aplicação";

/* No comment provided by engineer. */
"Go Back" = "Anterior";

/* No comment provided by engineer. */
"Go Forward" = "Avançar";

/* SecurityViewController */
"Handle tapping on links in a non-standard way to avoid possibly opening external applications." = "Lidar com toque nas hiperligações de uma forma não padronizada para evitar a possibilidade de abrir aplicações externas.";

/* No comment provided by engineer. */
"Host Settings" = "Definições de Hospedeiro";

/* No comment provided by engineer. */
"Host/domain" = "Hospedeiro / Domínio";

/* No comment provided by engineer. */
"Hosts" = "Hospedeiros";

/* No comment provided by engineer. */
"HTTPS Everywhere" = "HTTPS Everywhere";

/* No comment provided by engineer. */
"HTTPS Everywhere Rules" = "HTTPS Everywhere - Regras";

/* No comment provided by engineer. */
"Ignore for this host" = "Ignorar para este hospedeiro";

/* SecurityViewController */
"Ignore TLS Errors" = "Ignorar erros TLS";

/* No comment provided by engineer. */
"Invalid email address" = "Endereço de e-mail inválido";

/* Donate Scene. */
"Loading in-app purchase data…" = "Loading in-app purchase data…";

/* No comment provided by engineer. */
"Log In" = "Iniciar Sessão";

/* No comment provided by engineer. */
"Manage Bookmarks" = "Gerir Marcadores";

/* SettingsViewController */
"Miscellaneous" = "Diversos";

/* SettingsViewController */
"Mute Audio with Mute Switch" = "Mute audio with mute switch";

/* No comment provided by engineer. */
"No" = "Não";

/* No comment provided by engineer. */
"No XHR/WebSocket/Video connections" = "Sem ligações de XHR/WebSocket/Vídeo";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Open" = "Abrir";

/* No comment provided by engineer. */
"Open (normal browsing mode)" = "Abrir (modo de navegação normal)";

/* No comment provided by engineer. */
"Open in a New Tab" = "Abrir num Novo Separador";

/* No comment provided by engineer. */
"Open in Background Tab" = "Abrir no 'Separador de Segundo Plano'";

/* No comment provided by engineer. */
"Open in Safari" = "Abrir no Safari";

/* No comment provided by engineer. */
"Other" = "Outros";

/* No comment provided by engineer. */
"Page bookmarked" = "Página colocada nos marcadores";

/* No comment provided by engineer. */
"Page Name (leave blank to use URL)" = "Nome da Página (deixar em branco para usar o URL)";

/* Password */
"Password" = "Palavra-passe";

/* Donate Scene. */
"Payment Sent" = "Payment Sent";

/* No comment provided by engineer. */
"Privacy" = "Privacidade";

/* No comment provided by engineer. */
"Pull to Refresh Page" = "Deslize para baixo para atualizar a página";

/* Donate Scene. */
"Purchase Failure" = "Purchase Failure";

/* SettingsViewController */
"Rate on App Store" = "Classificar na Loja de Aplicações";

/* No comment provided by engineer. */
"Refresh" = "Atualizar";

/* SettingsViewController */
"Report a Bug" = "Comunicar um erro";

/* No comment provided by engineer. */
"Resources loaded from external hosts will be blocked from loading page elements or making requests to LAN hosts (192.168.0.0/16, 172.16.0.0/12, etc.)" = "Os recursos carregados dos hospedeiros externos serão impedidos de carregar os elementos da página ou efetuar pedidos aos hospedeiros de REDE (192.168.0.0/16, 172.16.0.0/12, etc.)";

/* No comment provided by engineer. */
"Resources loaded from this host will be blocked from loading page elements or making requests to LAN hosts (192.168.0.0/16, 172.16.0.0/12, etc.)" = "Os recursos carregados deste hospedeiro serão impedidos de carregar os elementos da página ou efetuar pedidos aos hospedeiros de REDE (192.168.0.0/16, 172.16.0.0/12, etc.)";

/* No comment provided by engineer. */
"Restrictions on resources loaded from web pages" = "Restrições nos recursos carregados das páginas da Web";

/* No comment provided by engineer. */
"Restrictions on resources loaded from web pages at this host" = "Restrições nos recursos carregados das páginas da Web neste hospedeiro";

/* No comment provided by engineer. */
"Rules in use on current page" = "Regras em uso na página atual";

/* No comment provided by engineer. */
"Save Image" = "Guardar Imagem";

/* SettingsViewController */
"Search Engine" = "Motor de pesquisa";

/* No comment provided by engineer. */
"Security" = "Segurança";

/* SettingsViewController */
"Send Do-Not-Track Header" = "Enviar cabeçalho de Não Monitorizar";

/* No comment provided by engineer. */
"Settings" = "Definições";

/* No comment provided by engineer. */
"Share URL" = "Partilhar URL";

/* No comment provided by engineer. */
"Show Bookmarks" = "Mostrar Marcadores";

/* Donate Scene. */
"Sorry, in-app purchase is disabled on your device!" = "Sorry, in-app purchase is disabled on your device!";

/* No comment provided by engineer. */
"Strict (no JavaScript, video, etc.)" = "Estrito (sem JavaScript, vídeo, etc.)";

/* Donate Scene. */
"Support Onion Browser Development" = "Support Onion Browser Development";

/* No comment provided by engineer. */
"Switch to Tab %d" = "Mudar para Separador %d";

/* No comment provided by engineer. */
"These settings will apply to this host and all hosts under it (e.g., \"example.com\" will apply to example.com and www.example.com)" = "Estas definições serão aplicadas para este hospedeiro e todos os hospedeiros em (por exemplo, \"example.com\" será aplicado a example.com e www.example.com)";

/* No comment provided by engineer. */
"These settings will be used as defaults for all hosts unless overridden" = "Estas definições serão utilizadas como predefinição para todos os hospedeiros, a menos que sejam substituídas";

/* Donate Scene. */
"Tip: %@" = "Tip: %@";

/* SettingsViewController */
"TLS 1.2 Only" = "Apenas TLS 1.2";

/* SettingsViewController */
"TLS 1.2, 1.1 or 1.0" = "TLS 1.2, 1.1 ou 1.0";

/* No comment provided by engineer. */
"TLS certificate chain verification error (self-signed certificate?)" = "Erro de verificação da cadeia de certificado TLS (certificado auto assinado?)";

/* No comment provided by engineer. */
"TLS handshake failed" = "Handshake TLS falhou";

/* No comment provided by engineer. */
"TLS protocol error" = "Erro de protocolo TLS";

/* SettingsViewController */
"TLS Version" = "Versão de TLS";

/* No comment provided by engineer. */
"Universal Link Protection" = "Proteção de Hiperligação Universal";

/* No comment provided by engineer. */
"Unknown Organization" = "Organização Desconhecida";

/* No comment provided by engineer. */
"URL" = "URL";

/* No comment provided by engineer. */
"URL Blocker" = "Bloqueador de URL";

/* SecurityViewController */
"User Agent" = "Agente do Utilizador";

/* No comment provided by engineer. */
"User disabled" = "Desativado pelo Utilizador";

/* No comment provided by engineer. */
"Using defaults" = "A usar predefinições";

/* SecurityViewController */
"WebRTC" = "WebRTC";

/* No comment provided by engineer. */
"XLFormViewController_ValidationErrorTitle" = "Erro";

/* No comment provided by engineer. */
"Yes" = "Sim";

/* Donate Scene. */
"You most recently donated %@ on %@." = "You most recently donated %@ on %@.";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH1__" = "Onion Browser is a free app, but it takes time and resources to develop and maintain.";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH2__" = "You can support the app by sending a small tip through an in-app purchase, below. This is a one-time, non-recurring transaction, but you can come back any time to send another. No information about your in-app purchase is collected or stored by the Onion Browser developers.";

/* Donate Scene. */
"__DONATE_EXPLANATION_PARAGRAPH3__" = "You can learn about other ways to help (including Patreon, PayPal, Bitcoin, or Zcash) in the 'About' section of the 'Settings' page.";

/* Donate Scene. */
"__DONATE_THANKS__" = "Thank you! Every little bit helps! Your payment of %@ helps ensure continuing development on Onion Browser and tools that make Tor easier to integrate into other iOS apps.";
